<?php

// Array huruf lokal
$HurufLocals = [
    ['ㅏ', 'A'],
    ['ㅑ', 'Ya'],
    ['ㅓ', 'Eo'],
    ['ㅕ', 'Yeo'],
    ['ㅗ', 'O'],
    ['ㅛ', 'Yo'],
    ['ㅜ', 'U'],
    ['ㅠ', 'Yu'],
    ['ㅡ', 'Eu'],
    ['ㅣ', 'I'],
    ['ㅐ', 'Ae'],
    ['ㅒ', 'Yae'],
    ['ㅔ', 'E'],
    ['ㅖ', 'Ye'],
    ['ㅘ', 'Wa'],
    ['ㅙ', 'Wae'],
    ['ㅚ', 'Oe'],
    ['ㅞ', 'We'],
    ['ㅝ', 'Wo'],
    ['ㅟ', 'Wi'],
    ['ㅢ', 'Ui/Yi']
];

// Array hruf konsonan
$HurufKonsonans = [
    ['ㄱ', 'G/K'],
    ['ㄴ', 'N'],
    ['ㄷ', 'D'],
    ['ㄹ', 'R/L'],
    ['ㅁ', 'M'],
    ['ㅂ', 'B/P'],
    ['ㅅ', 'S'],
    ['ㅇ', '-Ng'],
    ['ㅈ', 'J/C'],
    ['ㅋ', 'Kh'],
    ['ㅌ', 'T'],
    ['ㅍ', 'P'],
    ['ㅊ', 'Ch'],
    ['ㅎ', 'H']
];

// array angka korea 1 - 10
$angkaKoreans = [
    [0, '공', 'gong', '영', 'yeong'],
    [1, '하나', 'hana', '일', 'il'],
    [2, '둘', 'dul', '이', 'i'],
    [3, '셋', 'set', '삼', 'sam'],
    [4, '넷', 'net', '사', 'sa'],
    [5, '다섯', 'daseot', '오', 'o'],
    [6, '여섯', 'yeseot', '육', 'yuk'],
    [7, '일곱', 'ilgop', '칠', 'chil'],
    [8, '여덟', 'yeodeol', '팔', 'pal'],
    [9, '아홉', 'ahop', '구', 'gu'],
    [10, '열', 'yeol', '십', 'ship']
];